function [H]=Hsis(M,avg_weight)
  % H=(M(2)+0.9*( M(4)+M(7)+M(8)+M(9) )+( M(5)+M(6) )*0.8+( M(14)+M(15) )*0.7+M(16)*0.6+M(17)*0.5+M(18)*0.4+M(20)*0.3+M(19)*0.2)
%上式可以命名为加权类曼哈顿距离花费
   %基本都是前向的。可能分不太出来吧
%用欧氏距离计算
    load("all.mat");
    Mf=M0;
    %通路中的曼哈顿距离
    Mf(2)=0;
    Mf(11)=20;
    %H=avg_weight*sum(abs(M([2,4,7,8,9,5,6,14,15,16,17,18,20,19])-Mf([2,4,7,8,9,5,6,14,15,16,17,18,20,19])))
     %H=avg_weight*sum(abs(M-Mf))
     %欧氏距离
     %H = 1000*norm(Mf - M, 'fro')% 计算 A 和 B 的欧氏距离
     H = 5*avg_weight*norm(M([2,4,7,8,9,5,6,14,15,16,17,18,20,19,11])-Mf([2,4,7,8,9,5,6,14,15,16,17,18,20,19,11]), 'fro')% 计算 A 和 B 的欧氏距离
% H=1;
end
%每次在主函数中的时候，计算曼哈顿距离的变化（即两次M的变化）与时间（即T）的关系，给出一个平均权重传入函数中是否可行？
%不太可行，求解速度过慢

%如果传入函数中的参数包括T和i，可否区别不同的变迁来选择权重

